[
    {
        "completionMessage": "All prayers completed for today!",
        "partialCompletionMessage": "MashaAllah, you completed your prayers today. May Allah reward your effort and help you pray all on time tomorrow, inshaAllah.",
        "blessingMessage": "May Allah accept your salah and bless your day."
    },
    {
        "completionMessage": "You've completed all your prayers today!",
        "partialCompletionMessage": "Well done for completing your five prayers today. Strive to guard their timing more closely tomorrow, inshaAllah. Allah sees your efforts.",
        "blessingMessage": "May Allah reward your dedication and grant you peace."
    },
    {
        "completionMessage": "Alhamdulillah, all prayers done for today!",
        "partialCompletionMessage": "May Allah bless you for fulfilling your daily prayers. Aim to perfect their timing tomorrow, inshaAllah. Every step counts.",
        "blessingMessage": "May Allah shower His blessings upon your worship."
    },
    {
        "completionMessage": "Masha'Allah, every prayer completed today!",
        "partialCompletionMessage": "You made it through all five prayers—Alhamdulillah! Let’s aim for all on time tomorrow, inshaAllah. Allah is Most Merciful.",
        "blessingMessage": "May Allah accept your efforts and guide your heart."
    },
    {
        "completionMessage": "All daily prayers accomplished!",
        "partialCompletionMessage": "Great progress! Completing all your prayers is a beautiful step. Try to catch every one on time next time, inshaAllah.",
        "blessingMessage": "May Allah make your salah a means of closeness to Him."
    },
    {
        "completionMessage": "SubhanAllah, all prayers checked off today!",
        "partialCompletionMessage": "May Allah reward your consistency. Let this be a reminder to strive for timely prayers next time, inshaAllah.",
        "blessingMessage": "May Allah bless your commitment and strengthen your faith."
    },
    {
        "completionMessage": "Today's prayers are all complete!",
        "partialCompletionMessage": "Alhamdulillah for every prayer you completed today. With intention and effort, tomorrow can be even better, inshaAllah.",
        "blessingMessage": "May Allah grant you tranquility through your worship."
    },
    {
        "completionMessage": "You've nailed all your prayers today!",
        "partialCompletionMessage": "Your commitment is inspiring. May Allah make it easy for you to pray on time always, inshaAllah.",
        "blessingMessage": "May Allah accept your devotion and uplift your spirit."
    },
    {
        "completionMessage": "All five prayers completed today!",
        "partialCompletionMessage": "Every prayer counts. May Allah continue to guide you, and help you improve your timing each day, inshaAllah.",
        "blessingMessage": "May Allah reward your steadfastness with His mercy."
    },
    {
        "completionMessage": "Bravo, all prayers done for the day!",
        "partialCompletionMessage": "May your prayers be accepted. Keep striving—timeliness brings more barakah, inshaAllah.",
        "blessingMessage": "May Allah make your salah a light for your path."
    }
]
