[
    {
        "when": "Upon entering the home:",
        "arabic": "بِسْمِ ٱللَّهِ وَلَجْنَا، وَبِسْمِ ٱللَّهِ خَرَجْنَا، وَعَلَىٰ رَبِّنَا تَوَكَّلْنَا",
        "transliteration": "Bismillahi walajna, wa bismillahi kharajna, wa ‘ala Rabbina tawakkalna",
        "english": "In the name of Allah we enter, and in the name of Allah we leave, and upon our Lord we place our trust."
    },
    {
        "when": "After completing the prayer:",
        "arabic": "ٱللَّهُمَّ أَنْتَ ٱلسَّلَامُ وَمِنْكَ ٱلسَّلَامُ تَبَارَكْتَ يَا ذَا ٱلْجَلَالِ وَٱلْإِكْرَامِ",
        "transliteration": "Allahumma anta as-salam wa minka as-salam tabarakta ya dhal-jalali wal-ikram",
        "english": "O Allah, You are Peace, and from You comes peace. Blessed are You, O Possessor of majesty and honor."
    },
    {
        "when": "When leaving the home:",
        "arabic": "بِسْمِ ٱللَّهِ تَوَكَّلْتُ عَلَىٰ ٱللَّهِ وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِٱللَّهِ",
        "transliteration": "Bismillah, tawakkaltu ‘ala Allah, wa la hawla wa la quwwata illa billah",
        "english": "In the name of Allah, I place my trust in Allah, and there is no might nor power except with Allah."
    },
    {
        "when": "When feeling distressed:",
        "arabic": "حَسْبِيَ ٱللَّهُ لَا إِلَٰهَ إِلَّا هُوَ عَلَيْهِ تَوَكَّلْتُ وَهُوَ رَبُّ ٱلْعَرْشِ ٱلْعَظِيمِ",
        "transliteration": "Hasbiyallahu la ilaha illa Huwa ‘alayhi tawakkaltu wa Huwa Rabbul ‘arshil ‘adheem",
        "english": "Allah is sufficient for me; there is no god but He. On Him I rely, and He is the Lord of the Mighty Throne."
    },
    {
        "when": "After eating:",
        "arabic": "ٱلْحَمْدُ لِلَّهِ ٱلَّذِي أَطْعَمَنِي هَٰذَا وَرَزَقَنِيهِ مِنْ غَيْرِ حَوْلٍ مِنِّي وَلَا قُوَّةٍ",
        "transliteration": "Alhamdulillahilladhi at‘amani hadha wa razaqanihi min ghayri hawlin minni wa la quwwah",
        "english": "All praise is due to Allah who has fed me this and provided it for me without any strength or power on my part."
    },
    {
        "when": "Upon waking up:",
        "arabic": "ٱلْحَمْدُ لِلَّهِ ٱلَّذِي أَحْيَانَا بَعْدَ مَا أَمَاتَنَا وَإِلَيْهِ ٱلنُّشُورُ",
        "transliteration": "Alhamdulillahilladhi ahyana ba‘da ma amatana wa ilayhin-nushur",
        "english": "All praise is due to Allah who gave us life after having taken it from us, and to Him is the resurrection."
    },
    {
        "when": "Before sleeping:",
        "arabic": "بِاسْمِكَ ٱللَّهُمَّ أَمُوتُ وَأَحْيَا",
        "transliteration": "Bismika Allahumma amutu wa ahya",
        "english": "In Your name, O Allah, I die and I live."
    },
    {
        "when": "Upon entering the mosque:",
        "arabic": "ٱللَّهُمَّ ٱفْتَحْ لِي أَبْوَابَ رَحْمَتِكَ",
        "transliteration": "Allahumma iftah li abwaba rahmatik",
        "english": "O Allah, open for me the doors of Your mercy."
    },
    {
        "when": "Upon leaving the mosque:",
        "arabic": "ٱللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ فَضْلِكَ",
        "transliteration": "Allahumma inni as’aluka min fadlika",
        "english": "O Allah, I ask You from Your bounty."
    },
    {
        "when": "Before wudu (ablution):",
        "arabic": "بِسْمِ ٱللَّهِ",
        "transliteration": "Bismillah",
        "english": "In the name of Allah."
    },
    {
        "when": "After wudu (ablution):",
        "arabic": "أَشْهَدُ أَنْ لَا إِلَٰهَ إِلَّا ٱللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ",
        "transliteration": "Ash-hadu an la ilaha illallahu wahdahu la sharika lah, wa ash-hadu anna Muhammadan ‘abduhu wa rasuluh",
        "english": "I bear witness that there is no god but Allah alone, without any partner, and I bear witness that Muhammad is His servant and Messenger."
    },
    {
        "when": "Upon hearing the Adhan (call to prayer):",
        "arabic": "ٱللَّهُمَّ رَبَّ هَٰذِهِ ٱلدَّعْوَةِ ٱلتَّامَّةِ وَٱلصَّلَاةِ ٱلْقَائِمَةِ آتِ مُحَمَّدًا ٱلْوَسِيلَةَ وَٱلْفَضِيلَةَ وَٱبْعَثْهُ مَقَامًا مَحْمُودًا ٱلَّذِي وَعَدْتَهُ",
        "transliteration": "Allahumma Rabba hadhihid-da‘watit-tammah, was-salatil-qa’imah, ati Muhammadan al-wasilah wal-fadilah, wab‘athhu maqaman mahmudan alladhi wa‘adtah",
        "english": "O Allah, Lord of this perfect call and established prayer, grant Muhammad the intercession and favor, and raise him to the praised station You have promised him."
    },
    {
        "when": "When sneezing:",
        "arabic": "ٱلْحَمْدُ لِلَّهِ",
        "transliteration": "Alhamdulillah",
        "english": "All praise is due to Allah."
    },
    {
        "when": "Responding to someone who sneezes:",
        "arabic": "يَرْحَمُكَ ٱللَّهُ",
        "transliteration": "YarhamukAllah",
        "english": "May Allah have mercy on you."
    },
    {
        "when": "Upon seeing someone in distress:",
        "arabic": "ٱلْحَمْدُ لِلَّهِ ٱلَّذِي عَافَانِي مِمَّا ٱبْتَلَاكَ بِهِ وَفَضَّلَنِي عَلَىٰ كَثِيرٍ مِمَّنْ خَلَقَ تَفْضِيلًا",
        "transliteration": "Alhamdulillahilladhi ‘afani mimmabtalaka bihi wa faddalani ‘ala kathirin mimman khalaqa tafdila",
        "english": "All praise is due to Allah who has saved me from that which He tested you with and preferred me over much of His creation."
    },
    {
        "when": "For protection from harm:",
        "arabic": "أَعُوذُ بِكَلِمَاتِ ٱللَّهِ ٱلتَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ",
        "transliteration": "A‘udhu bikalimatillahit-tammati min sharri ma khalaq",
        "english": "I seek refuge in the perfect words of Allah from the evil of what He has created."
    },
    {
        "when": "When starting a journey:",
        "arabic": "ٱللَّهُمَّ إِنَّا نَسْأَلُكَ فِي سَفَرِنَا هَٰذَا ٱلْبِرَّ وَٱلتَّقْوَىٰ وَمِنَ ٱلْعَمَلِ مَا تَرْضَىٰ",
        "transliteration": "Allahumma inna nas’aluka fi safarina hadha al-birra wat-taqwa wa minal-‘amali ma tarda",
        "english": "O Allah, we ask You during this journey of ours for righteousness and piety, and for deeds that are pleasing to You."
    },
    {
        "when": "When returning from a journey:",
        "arabic": "آيِبُونَ تَائِبُونَ عَابِدُونَ لِرَبِّنَا حَامِدُونَ",
        "transliteration": "Ayibuna ta’ibuna ‘abiduna li-Rabbina hamidun",
        "english": "We return, repent, worship, and praise our Lord."
    },
    {
        "when": "For seeking forgiveness:",
        "arabic": "أَسْتَغْفِرُ ٱللَّهَ ٱلَّذِي لَا إِلَٰهَ إِلَّا هُوَ ٱلْحَيُّ ٱلْقَيُّومُ وَأَتُوبُ إِلَيْهِ",
        "transliteration": "Astaghfirullahalladhi la ilaha illa Huwal-Hayyul-Qayyum wa atubu ilayh",
        "english": "I seek forgiveness from Allah, there is no god but He, the Ever-Living, the Sustainer, and I turn to Him in repentance."
    },
    {
        "when": "When entering the bathroom:",
        "arabic": "ٱللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ ٱلْخُبْثِ وَٱلْخَبَائِثِ",
        "transliteration": "Allahumma inni a‘udhu bika minal-khubthi wal-khaba’ith",
        "english": "O Allah, I seek refuge with You from male and female devils."
    },
    {
        "when": "When leaving the bathroom:",
        "arabic": "غُفْرَانَكَ",
        "transliteration": "Ghufranak",
        "english": "I seek Your forgiveness."
    },
    {
        "when": "When breaking the fast:",
        "arabic": "ٱللَّهُمَّ لَكَ صُمْتُ وَعَلَىٰ رِزْقِكَ أَفْطَرْتُ",
        "transliteration": "Allahumma laka sumtu wa ‘ala rizqika aftartu",
        "english": "O Allah, for You I have fasted, and with Your provision I break my fast."
    },
    {
        "when": "When seeking knowledge:",
        "arabic": "ٱللَّهُمَّ ٱنْفَعْنِي بِمَا عَلَّمْتَنِي وَعَلِّمْنِي مَا يَنْفَعُنِي",
        "transliteration": "Allahumma anfa‘ni bima ‘allamtani wa ‘allimni ma yanfa‘uni",
        "english": "O Allah, benefit me with what You have taught me, and teach me what will benefit me."
    },
    {
        "when": "For morning remembrance:",
        "arabic": "أَصْبَحْنَا وَأَصْبَحَ ٱلْمُلْكُ لِلَّهِ وَٱلْحَمْدُ لِلَّهِ لَا إِلَٰهَ إِلَّا ٱللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ",
        "transliteration": "Asbahna wa asbahal-mulku lillahi wal-hamdu lillahi la ilaha illallahu wahdahu la sharika lah",
        "english": "We have reached the morning, and the dominion belongs to Allah. All praise is due to Allah; there is no god but Allah, alone without any partner."
    },
    {
        "when": "For evening remembrance:",
        "arabic": "أَمْسَيْنَا وَأَمْسَى ٱلْمُلْكُ لِلَّهِ وَٱلْحَمْدُ لِلَّهِ لَا إِلَٰهَ إِلَّا ٱللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ",
        "transliteration": "Amsayna wa amsal-mulku lillahi wal-hamdu lillahi la ilaha illallahu wahdahu la sharika lah",
        "english": "We have reached the evening, and the dominion belongs to Allah. All praise is due to Allah; there is no god but Allah, alone without any partner."
    },
    {
        "when": "For protection from evil eye:",
        "arabic": "أَعُوذُ بِكَلِمَاتِ ٱللَّهِ ٱلتَّامَّةِ مِنْ كُلِّ شَيْطَانٍ وَهَامَّةٍ وَمِنْ كُلِّ عَيْنٍ لَامَّةٍ",
        "transliteration": "A‘udhu bikalimatillahit-tammati min kulli shaytanin wa hammatin wa min kulli ‘aynin lammatin",
        "english": "I seek refuge in the perfect words of Allah from every devil, poisonous creature, and every envious eye."
    },
    {
        "when": "When visiting the sick:",
        "arabic": "أَسْأَلُ ٱللَّهَ ٱلْعَظِيمَ رَبَّ ٱلْعَرْشِ ٱلْعَظِيمِ أَنْ يَشْفِيَكَ",
        "transliteration": "As’alullahal-‘Adheema Rabbal-‘Arshil-‘Adheemi an yashfiyak",
        "english": "I ask Allah, the Mighty, Lord of the Mighty Throne, to cure you."
    },
    {
        "when": "For entering a marketplace:",
        "arabic": "لَا إِلَٰهَ إِلَّا ٱللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ لَهُ ٱلْمُلْكُ وَلَهُ ٱلْحَمْدُ يُحْيِي وَيُمِيتُ وَهُوَ حَيٌّ لَا يَمُوتُ بِيَدِهِ ٱلْخَيْرُ وَهُوَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ",
        "transliteration": "La ilaha illallahu wahdahu la sharika lah, lahul-mulku wa lahul-hamdu yuhyi wa yumitu wa huwa hayyun la yamutu biyadihil-khayru wa huwa ‘ala kulli shay’in qadir",
        "english": "There is no god but Allah, alone without any partner. To Him belongs the dominion and all praise. He gives life and causes death, and He is the Ever-Living who never dies. In His Hand is all good, and He is over all things capable."
    },
    {
        "when": "When experiencing fear:",
        "arabic": "ٱللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ ٱلْخَوْفِ وَٱلْجُبْنِ",
        "transliteration": "Allahumma inni a‘udhu bika minal-khawfi wal-jubn",
        "english": "O Allah, I seek refuge in You from fear and cowardice."
    },
    {
        "when": "For seeking guidance (Istikhara):",
        "arabic": "ٱللَّهُمَّ إِنِّي أَسْتَخِيرُكَ بِعِلْمِكَ وَأَسْتَقْدِرُكَ بِقُدْرَتِكَ وَأَسْأَلُكَ مِنْ فَضْلِكَ ٱلْعَظِيمِ",
        "transliteration": "Allahumma inni astakhiruka bi‘ilmika wa astaqdiruka biqudratika wa as’aluka min fadlika al-‘adheem",
        "english": "O Allah, I seek Your guidance by Your knowledge and Your power by Your might, and I ask You from Your immense favor."
    },
    {
        "when": "When it rains:",
        "arabic": "ٱللَّهُمَّ صَيِّبًا نَافِعًا",
        "transliteration": "Allahumma sayyiban nafi‘an",
        "english": "O Allah, make it a beneficial rain."
    },
    {
        "when": "After a nightmare:",
        "arabic": "أَعُوذُ بِكَلِمَاتِ ٱللَّهِ ٱلتَّامَّةِ مِنْ غَضَبِهِ وَعِقَابِهِ وَشَرِّ عِبَادِهِ وَمِنْ هَمَزَاتِ ٱلشَّيَاطِينِ وَأَنْ يَحْضُرُونَ",
        "transliteration": "A‘udhu bikalimatillahit-tammati min ghadabihi wa ‘iqabihi wa sharri ‘ibadihi wa min hamazatish-shayateeni wa an yahdurun",
        "english": "I seek refuge in the perfect words of Allah from His anger, His punishment, the evil of His servants, and from the whispers of devils and their presence."
    },
    {
        "when": "For parents:",
        "arabic": "رَبِّ ٱرْحَمْهُمَا كَمَا رَبَّيَانِي صَغِيرًا",
        "transliteration": "Rabbirhamhuma kama rabbayani sagheera",
        "english": "My Lord, have mercy upon them as they brought me up when I was young."
    },
    {
        "when": "When wearing new clothes:",
        "arabic": "ٱللَّهُمَّ لَكَ ٱلْحَمْدُ أَنْتَ كَسَوْتَنِيهِ أَسْأَلُكَ مِنْ خَيْرِهِ وَخَيْرِ مَا صُنِعَ لَهُ",
        "transliteration": "Allahumma laka al-hamdu anta kasawtanihi as’aluka min khayrihi wa khayri ma suni‘a lah",
        "english": "O Allah, to You be praise, You have clothed me with it. I ask You for its good and the good for which it was made."
    },
    {
        "when": "For entering a new month:",
        "arabic": "ٱللَّهُمَّ أَدْخِلْهُ عَلَيْنَا بِٱلْأَمْنِ وَٱلْإِيمَانِ وَٱلسَّلَامَةِ وَٱلْإِسْلَامِ",
        "transliteration": "Allahumma adkhilhu ‘alayna bil-amni wal-imani was-salamati wal-Islam",
        "english": "O Allah, bring it upon us with security, faith, safety, and Islam."
    },
    {
        "when": "When seeing the new moon:",
        "arabic": "ٱللَّهُمَّ أَهِلَّهُ عَلَيْنَا بِٱلْيُمْنِ وَٱلْإِيمَانِ وَٱلسَّلَامَةِ وَٱلْإِسْلَامِ",
        "transliteration": "Allahumma ahillahu ‘alayna bilyumni wal-imani was-salamati wal-Islam",
        "english": "O Allah, let this moon appear to us with blessings, faith, safety, and Islam."
    },
    {
        "when": "For expelling Satan:",
        "arabic": "أَعُوذُ بِٱللَّهِ مِنَ ٱلشَّيْطَانِ ٱلرَّجِيمِ",
        "transliteration": "A‘udhu billahi minash-shaytanir-rajeem",
        "english": "I seek refuge in Allah from the accursed Satan."
    },
    {
        "when": "For ease in difficulties:",
        "arabic": "ٱللَّهُمَّ لَا سَهْلَ إِلَّا مَا جَعَلْتَهُ سَهْلًا وَأَنْتَ تَجْعَلُ ٱلْحَزْنَ إِذَا شِئْتَ سَهْلًا",
        "transliteration": "Allahumma la sahla illa ma ja‘altahu sahlan wa anta taj‘alul-hazna idha shi’ta sahlan",
        "english": "O Allah, there is no ease except what You make easy, and You make difficulty easy when You will."
    },
    {
        "when": "When thanking someone:",
        "arabic": "جَزَاكَ ٱللَّهُ خَيْرًا",
        "transliteration": "JazakAllahu khayran",
        "english": "May Allah reward you with goodness."
    },
    {
        "when": "For protection of children:",
        "arabic": "أُعِيذُكُمْ بِكَلِمَاتِ ٱللَّهِ ٱلتَّامَّةِ مِنْ كُلِّ شَيْطَانٍ وَهَامَّةٍ وَمِنْ كُلِّ عَيْنٍ لَامَّةٍ",
        "transliteration": "U‘eedhukum bikalimatillahit-tammati min kulli shaytanin wa hammatin wa min kulli ‘aynin lammatin",
        "english": "I seek refuge for you in the perfect words of Allah from every devil, poisonous creature, and every envious eye."
    },
    {
        "when": "When intending to do something:",
        "arabic": "إِنْ شَاءَ ٱللَّهُ",
        "transliteration": "In sha’Allah",
        "english": "If Allah wills."
    },
    {
        "when": "For success in endeavors:",
        "arabic": "ٱللَّهُمَّ يَسِّرْ وَلَا تُعَسِّرْ",
        "transliteration": "Allahumma yassir wala tu‘assir",
        "english": "O Allah, make it easy and do not make it difficult."
    },
    {
        "when": "When seeing something pleasing:",
        "arabic": "تَبَارَكَ ٱللَّهُ أَحْسَنُ ٱلْخَالِقِينَ",
        "transliteration": "TabarakAllah ahsanul-khaliqeen",
        "english": "Blessed is Allah, the best of creators."
    },
    {
        "when": "For protection from trials:",
        "arabic": "ٱللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ فِتْنَةِ ٱلنَّارِ وَعَذَابِ ٱلنَّارِ وَفِتْنَةِ ٱلْقَبْرِ وَعَذَابِ ٱلْقَبْرِ",
        "transliteration": "Allahumma inni a‘udhu bika min fitnatin-nari wa ‘adhabin-nari wa fitnatil-qabri wa ‘adhabil-qabr",
        "english": "O Allah, I seek refuge in You from the trial of the Fire, the punishment of the Fire, the trial of the grave, and the punishment of the grave."
    },
    {
        "when": "For seeking sustenance:",
        "arabic": "ٱللَّهُمَّ ٱرْزُقْنِي رِزْقًا حَلَالًا طَيِّبًا",
        "transliteration": "Allahumma arzuqni rizqan halalan tayyiban",
        "english": "O Allah, grant me lawful and pure sustenance."
    },
    {
        "when": "When feeling pain:",
        "arabic": "أَعُوذُ بِٱللَّهِ وَقُدْرَتِهِ مِنْ شَرِّ مَا أَجِدُ وَأُحَاذِرُ",
        "transliteration": "A‘udhu billahi wa qudratihi min sharri ma ajidu wa uhadhir",
        "english": "I seek refuge in Allah and His power from the evil of what I feel and fear."
    },
    {
        "when": "For protection from all evil:",
        "arabic": "ٱللَّهُمَّ ٱحْفَظْنِي مِنْ بَيْنِ يَدَيَّ وَمِنْ خَلْفِي وَعَنْ يَمِينِي وَعَنْ شِمَالِي وَمِنْ فَوْقِي وَأَعُوذُ بِعَظَمَتِكَ أَنْ أُغْتَالَ مِنْ تَحْتِي",
        "transliteration": "Allahumma ihfazni min bayni yadayya wa min khalfi wa ‘an yamini wa ‘an shimali wa min fawqi wa a‘udhu bi‘azamatika an ughtala min tahti",
        "english": "O Allah, protect me from in front of me, from behind me, from my right, from my left, from above me, and I seek refuge in Your greatness from being taken unawares from below me."
    },
    {
        "when": "For forgiveness and mercy:",
        "arabic": "ٱللَّهُمَّ ٱغْفِرْ لِي ذَنْبِي كُلَّهُ دِقَّهُ وَجِلَّهُ وَأَوَّلَهُ وَآخِرَهُ وَعَلَانِيَتَهُ وَسِرَّهُ",
        "transliteration": "Allahummaghfir li dhanbi kullahu diqqahu wa jillahu wa awwalahu wa akhirahu wa ‘alaniyatahu wa sirrahu",
        "english": "O Allah, forgive me all my sins, the small and the great, the first and the last, the open and the secret."
    },
    {
        "when": "For steadfastness in faith:",
        "arabic": "ٱللَّهُمَّ يَا مُقَلِّبَ ٱلْقُلُوبِ ثَبِّتْ قَلْبِي عَلَىٰ دِينِكَ",
        "transliteration": "Allahumma ya muqallibal-qulubi thabbit qalbi ‘ala deenik",
        "english": "O Allah, O Turner of hearts, make my heart firm upon Your religion."
    },
    {
        "when": "For protection from Hellfire:",
        "arabic": "ٱللَّهُمَّ أَجِرْنِي مِنَ ٱلنَّارِ",
        "transliteration": "Allahumma ajirni minan-nar",
        "english": "O Allah, save me from the Fire."
    },
    {
        "when": "For entering Jannah (Paradise):",
        "arabic": "ٱللَّهُمَّ إِنِّي أَسْأَلُكَ ٱلْجَنَّةَ وَأَعُوذُ بِكَ مِنَ ٱلنَّارِ",
        "transliteration": "Allahumma inni as’alukal-jannata wa a‘udhu bika minan-nar",
        "english": "O Allah, I ask You for Paradise and seek refuge in You from the Fire."
    },
    {
        "when": "For guidance and righteousness:",
        "arabic": "ٱللَّهُمَّ ٱهْدِنِي وَسَدِّدْنِي",
        "transliteration": "Allahumma ihdini wa saddidni",
        "english": "O Allah, guide me and make me upright."
    },
    {
        "when": "For good character:",
        "arabic": "ٱللَّهُمَّ أَحْسَنْتَ خَلْقِي فَأَحْسِنْ خُلُقِي",
        "transliteration": "Allahumma ahsanta khalqi fa ahsin khuluqi",
        "english": "O Allah, You have perfected my creation, so perfect my character."
    },
    {
        "when": "For protection from trials:",
        "arabic": "ٱللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ فِتْنَةِ ٱلْمَحْيَا وَٱلْمَمَاتِ",
        "transliteration": "Allahumma inni a‘udhu bika min fitnatil-mahya wal-mamat",
        "english": "O Allah, I seek refuge in You from the trials of life and death."
    },
    {
        "when": "For relief from debt:",
        "arabic": "ٱللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ ٱلْهَمِّ وَٱلْحَزَنِ وَأَعُوذُ بِكَ مِنَ ٱلْعَجْزِ وَٱلْكَسَلِ وَأَعُوذُ بِكَ مِنَ ٱلْجُبْنِ وَٱلْبُخْلِ وَأَعُوذُ بِكَ مِنْ غَلَبَةِ ٱلدَّيْنِ وَقَهْرِ ٱلرِّجَالِ",
        "transliteration": "Allahumma inni a‘udhu bika minal-hammi wal-hazan, wa a‘udhu bika minal-‘ajzi wal-kasal, wa a‘udhu bika minal-jubni wal-bukhl, wa a‘udhu bika min ghalabatid-dayni wa qahrir-rijal",
        "english": "O Allah, I seek refuge in You from anxiety and sorrow, weakness and laziness, cowardice and miserliness, and from being overcome by debt and the oppression of men."
    },
    {
        "when": "For patience and reward:",
        "arabic": "إِنَّا لِلَّهِ وَإِنَّا إِلَيْهِ رَاجِعُونَ ٱللَّهُمَّ أْجُرْنِي فِي مُصِيبَتِي وَأَخْلِفْ لِي خَيْرًا مِنْهَا",
        "transliteration": "Inna lillahi wa inna ilayhi raji‘un, Allahumma ajurni fi musibati wa akhlif li khayran minha",
        "english": "Indeed, to Allah we belong and to Him we shall return. O Allah, reward me for my affliction and replace it with something better."
    },
    {
        "when": "For acceptance of deeds:",
        "arabic": "ٱللَّهُمَّ ٱجْعَلْ عَمَلِي صَالِحًا وَٱجْعَلْهُ لَكَ خَالِصًا وَلَا تَجْعَلْ لِأَحَدٍ فِيهِ شَيْئًا",
        "transliteration": "Allahummaj‘al ‘amali salihan waj‘alhu laka khalisan wala taj‘al li’ahadin fihi shay’an",
        "english": "O Allah, make my deeds righteous, make them sincere for You, and do not let anyone have a share in them."
    },
    {
        "when": "For protection from hypocrisy:",
        "arabic": "ٱللَّهُمَّ طَهِّرْ قَلْبِي مِنَ ٱلنِّفَاقِ وَعَمَلِي مِنَ ٱلرِّيَاءِ",
        "transliteration": "Allahumma tahhir qalbi minan-nifaqi wa ‘amali minar-riya’",
        "english": "O Allah, purify my heart from hypocrisy and my actions from showing off."
    },
    {
        "when": "For a good end:",
        "arabic": "ٱللَّهُمَّ ٱجْعَلْ خَيْرَ عُمْرِي آخِرَهُ وَخَيْرَ عَمَلِي خَوَاتِيمَهُ وَخَيْرَ أَيَّامِي يَوْمَ أَلْقَاكَ",
        "transliteration": "Allahummaj‘al khayra ‘umri akhirahu wa khayra ‘amali khawatimahu wa khayra ayyami yawma alqak",
        "english": "O Allah, make the best part of my life its end, the best of my deeds their conclusion, and the best of my days the day I meet You."
    },
    {
        "when": "For blessings in sustenance:",
        "arabic": "ٱللَّهُمَّ ٱكْفِنِي بِحَلَالِكَ عَنْ حَرَامِكَ وَأَغْنِنِي بِفَضْلِكَ عَمَّنْ سِوَاكَ",
        "transliteration": "Allahummakfini bihalalika ‘an haramik, wa aghnini bifadlika ‘amman siwak",
        "english": "O Allah, suffice me with Your lawful provision against Your forbidden, and make me independent of all besides You by Your grace."
    },
    {
        "when": "For protection from oppression:",
        "arabic": "ٱللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ ٱلظُّلْمِ وَٱلْمَظْلُومِ",
        "transliteration": "Allahumma inni a‘udhu bika minadh-dhulmi wal-madhlum",
        "english": "O Allah, I seek refuge in You from oppressing or being oppressed."
    },
    {
        "when": "For a righteous spouse:",
        "arabic": "ٱللَّهُمَّ ٱرْزُقْنِي زَوْجًا صَالِحًا يُعِينُنِي عَلَىٰ طَاعَتِكَ",
        "transliteration": "Allahummarzuqni zawjan salihan yu‘inuni ‘ala ta‘atik",
        "english": "O Allah, grant me a righteous spouse who helps me in obeying You."
    },
    {
        "when": "For righteous children:",
        "arabic": "رَبِّ هَبْ لِي مِنَ ٱلصَّالِحِينَ",
        "transliteration": "Rabbi hab li minas-salihin",
        "english": "My Lord, grant me from among the righteous."
    },
    {
        "when": "For protection from laziness:",
        "arabic": "ٱللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ ٱلْعَجْزِ وَٱلْكَسَلِ",
        "transliteration": "Allahumma inni a‘udhu bika minal-‘ajzi wal-kasal",
        "english": "O Allah, I seek refuge in You from incapacity and laziness."
    },
    {
        "when": "For victory over enemies:",
        "arabic": "ٱللَّهُمَّ ٱنْصُرْنِي عَلَىٰ مَنْ ظَلَمَنِي",
        "transliteration": "Allahumma ansurni ‘ala man dhalamani",
        "english": "O Allah, grant me victory over those who oppress me."
    },
    {
        "when": "For protection from poverty:",
        "arabic": "ٱللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ ٱلْفَقْرِ وَٱلْقِلَّةِ وَٱلذِّلَّةِ",
        "transliteration": "Allahumma inni a‘udhu bika minal-faqri wal-qillati wadh-dhillah",
        "english": "O Allah, I seek refuge in You from poverty, scarcity, and humiliation."
    },
    {
        "when": "For ease in affairs:",
        "arabic": "ٱللَّهُمَّ يَسِّرْ لِي أَمْرِي وَٱفْتَحْ لِي أَبْوَابَ رَحْمَتِكَ",
        "transliteration": "Allahumma yassir li amri waftah li abwaba rahmatik",
        "english": "O Allah, make my affairs easy and open for me the doors of Your mercy."
    },
    {
        "when": "For protection from envy:",
        "arabic": "ٱللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ ٱلْحَسَدِ وَٱلْحَاسِدِينَ",
        "transliteration": "Allahumma inni a‘udhu bika minal-hasad wal-hasidin",
        "english": "O Allah, I seek refuge in You from envy and the envious."
    },
    {
        "when": "For contentment:",
        "arabic": "ٱللَّهُمَّ قَنِّعْنِي بِمَا رَزَقْتَنِي وَبَارِكْ لِي فِيهِ",
        "transliteration": "Allahumma qanni‘ni bima raziqtani wa barik li fih",
        "english": "O Allah, make me content with what You have provided me and bless me in it."
    },
    {
        "when": "For protection from disease:",
        "arabic": "ٱللَّهُمَّ عَافِنِي فِي بَدَنِي وَعَافِنِي فِي سَمْعِي وَعَافِنِي فِي بَصَرِي",
        "transliteration": "Allahumma ‘afini fi badani wa ‘afini fi sam‘i wa ‘afini fi basari",
        "english": "O Allah, grant me health in my body, my hearing, and my sight."
    },
    {
        "when": "For strength in worship:",
        "arabic": "ٱللَّهُمَّ أَعِنِّي عَلَىٰ ذِكْرِكَ وَشُكْرِكَ وَحُسْنِ عِبَادَتِكَ",
        "transliteration": "Allahumma a‘inni ‘ala dhikrika wa shukrika wa husni ‘ibadatik",
        "english": "O Allah, help me to remember You, to be grateful to You, and to worship You in the best manner."
    },
    {
        "when": "For seeking Allah’s pleasure:",
        "arabic": "ٱللَّهُمَّ إِنِّي أَسْأَلُكَ رِضَاكَ وَٱلْجَنَّةَ",
        "transliteration": "Allahumma inni as’aluka ridaka wal-jannah",
        "english": "O Allah, I ask You for Your pleasure and Paradise."
    },
    {
        "when": "For protection from arrogance:",
        "arabic": "ٱللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ ٱلْكِبْرِ وَٱلْعُجْبِ",
        "transliteration": "Allahumma inni a‘udhu bika minal-kibr wal-‘ujb",
        "english": "O Allah, I seek refuge in You from arrogance and self-admiration."
    },
    {
        "when": "For a sound heart:",
        "arabic": "ٱللَّهُمَّ ٱجْعَلْ قَلْبِي سَلِيمًا مِنْ كُلِّ دَاءٍ",
        "transliteration": "Allahummaj‘al qalbi saliman min kulli da’",
        "english": "O Allah, make my heart sound from every disease."
    },
    {
        "when": "For protection from betrayal:",
        "arabic": "ٱللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ ٱلْخِيَانَةِ وَٱلْمَخَادِعِ",
        "transliteration": "Allahumma inni a‘udhu bika minal-khiyanati wal-makhadi‘",
        "english": "O Allah, I seek refuge in You from betrayal and deceit."
    },
    {
        "when": "For protection from slander:",
        "arabic": "ٱللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ ٱلْبُهْتَانِ وَٱلْفِرْيَةِ",
        "transliteration": "Allahumma inni a‘udhu bika minal-buhtani wal-firyah",
        "english": "O Allah, I seek refuge in You from slander and false accusations."
    },
    {
        "when": "For a blessed family:",
        "arabic": "ٱللَّهُمَّ ٱجْعَلْ أَهْلِي وَوَلَدِي مِنَ ٱلصَّالِحِينَ",
        "transliteration": "Allahummaj‘al ahli wa waladi minas-salihin",
        "english": "O Allah, make my family and children among the righteous."
    },
    {
        "when": "For protection from despair:",
        "arabic": "ٱللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ ٱلْيَأْسِ وَٱلْقُنُوطِ",
        "transliteration": "Allahumma inni a‘udhu bika minal-ya’si wal-qunut",
        "english": "O Allah, I seek refuge in You from despair and hopelessness."
    },
    {
        "when": "For knowledge and wisdom:",
        "arabic": "ٱللَّهُمَّ ٱرْزُقْنِي عِلْمًا نَافِعًا وَحِكْمَةً بَالِغَةً",
        "transliteration": "Allahummarzuqni ‘ilman nafi‘an wa hikmatan balighah",
        "english": "O Allah, grant me beneficial knowledge and profound wisdom."
    },
    {
        "when": "For protection from whispers of Shaytan:",
        "arabic": "ٱللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ هَمَزَاتِ ٱلشَّيَاطِينِ",
        "transliteration": "Allahumma inni a‘udhu bika min hamazatish-shayatin",
        "english": "O Allah, I seek refuge in You from the whispers of the devils."
    },
    {
        "when": "For a blessed home:",
        "arabic": "ٱللَّهُمَّ ٱجْعَلْ بَيْتِي مَسْكَنًا طَيِّبًا وَرِزْقًا وَاسِعًا",
        "transliteration": "Allahummaj‘al bayti maskanan tayyiban wa rizqan wasi‘an",
        "english": "O Allah, make my home a pure dwelling and grant me abundant provision."
    },
    {
        "when": "For gratitude and contentment:",
        "arabic": "ٱللَّهُمَّ أَوْزِعْنِي أَنْ أَشْكُرَ نِعْمَتَكَ ٱلَّتِي أَنْعَمْتَ عَلَيَّ",
        "transliteration": "Allahumma awzi‘ni an ashkura ni‘mataka allati an‘amta ‘alayya",
        "english": "O Allah, inspire me to be grateful for the blessings You have bestowed upon me."
    },
    {
        "when": "For protection from calamity:",
        "arabic": "ٱللَّهُمَّ ٱصْرِفْ عَنِّي ٱلْبَلَاءَ وَٱلشَّقَاءَ",
        "transliteration": "Allahummasrif ‘anni al-bala’a wash-shaqqa’",
        "english": "O Allah, avert from me calamity and misery."
    },
    {
        "when": "For increase in faith:",
        "arabic": "ٱللَّهُمَّ زِدْنِي إِيمَانًا وَيَقِينًا",
        "transliteration": "Allahumma zidni imanan wa yaqinan",
        "english": "O Allah, increase me in faith and certainty."
    },
    {
        "when": "For protection from bad company:",
        "arabic": "ٱللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ صُحْبَةِ ٱلسُّوءِ",
        "transliteration": "Allahumma inni a‘udhu bika min suhbati as-su’",
        "english": "O Allah, I seek refuge in You from bad company."
    },
    {
        "when": "For a good reputation:",
        "arabic": "ٱللَّهُمَّ ٱجْعَلْ لِي لِسَانَ صِدْقٍ فِي ٱلنَّاسِ",
        "transliteration": "Allahummaj‘al li lisana sidqin fin-nas",
        "english": "O Allah, grant me a truthful reputation among people."
    },
    {
        "when": "For protection from greed:",
        "arabic": "ٱللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ ٱلشُّحِّ وَٱلطَّمَعِ",
        "transliteration": "Allahumma inni a‘udhu bika minash-shuhhi wat-tama‘",
        "english": "O Allah, I seek refuge in You from greed and avarice."
    },
    {
        "when": "For a blessed day:",
        "arabic": "ٱللَّهُمَّ ٱجْعَلْ يَوْمِي هَٰذَا يَوْمًا مُبَارَكًا",
        "transliteration": "Allahummaj‘al yawmi hadha yawman mubarakan",
        "english": "O Allah, make this day of mine a blessed day."
    },
    {
        "when": "For protection from ignorance:",
        "arabic": "ٱللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ ٱلْجَهْلِ وَٱلضَّلَالِ",
        "transliteration": "Allahumma inni a‘udhu bika minal-jahli wad-dalal",
        "english": "O Allah, I seek refuge in You from ignorance and misguidance."
    },
    {
        "when": "For a sound mind:",
        "arabic": "ٱللَّهُمَّ ٱحْفَظْ عَقْلِي وَدِينِي",
        "transliteration": "Allahumma ihfaz ‘aqli wa dini",
        "english": "O Allah, protect my mind and my religion."
    },
    {
        "when": "For protection from harm of enemies:",
        "arabic": "ٱللَّهُمَّ ٱكْفِنِي شَرَّ أَعْدَائِي",
        "transliteration": "Allahummakfini sharra a‘da’i",
        "english": "O Allah, suffice me against the evil of my enemies."
    },
    {
        "when": "For seeking Allah’s mercy:",
        "arabic": "ٱللَّهُمَّ ٱرْحَمْنِي بِرَحْمَتِكَ ٱلَّتِي وَسِعَتْ كُلَّ شَيْءٍ",
        "transliteration": "Allahummarhamni birahmatika allati wasi‘at kulla shay’",
        "english": "O Allah, have mercy on me with Your mercy that encompasses all things."
    },
    {
        "when": "For a blessed livelihood:",
        "arabic": "ٱللَّهُمَّ ٱرْزُقْنِي مَعِيشَةً طَيِّبَةً وَعَمَلًا مُتَقَبَّلًا",
        "transliteration": "Allahummarzuqni ma‘ishatan tayyibatan wa ‘amalan mutaqabbala",
        "english": "O Allah, grant me a pure livelihood and accepted deeds."
    },
    {
        "when": "For protection from sudden death:",
        "arabic": "ٱللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ مَوْتِ ٱلْفَجْأَةِ",
        "transliteration": "Allahumma inni a‘udhu bika min mawtil-faj’ah",
        "english": "O Allah, I seek refuge in You from sudden death."
    },
    {
        "when": "For a safe journey:",
        "arabic": "ٱللَّهُمَّ ٱحْفَظْنِي فِي سَفَرِي وَٱرْزُقْنِي ٱلسَّلَامَةَ",
        "transliteration": "Allahumma ihfazni fi safari warzuqni as-salamah",
        "english": "O Allah, protect me during my journey and grant me safety."
    },
    {
        "when": "For protection from black magic:",
        "arabic": "ٱللَّهُمَّ ٱحْفَظْنِي مِنَ ٱلسِّحْرِ وَٱلشَّرِّ",
        "transliteration": "Allahumma ihfazni minas-sihr wash-sharr",
        "english": "O Allah, protect me from black magic and evil."
    }
]
